In [126]:
# Import important packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
import statsmodels.formula.api as smf
import statsmodels.formula as sm
import time
import datetime

## Reading data (using Pandas)

### From .csv or .xlsx

In [31]:
## CSV
orders = pd.read_csv('orders.csv')
salesperson = pd.read_csv('salesperson.csv')
salesperson.columns = ['salespersonid', 'salespersonName', 'Age', 'Salary']
salesperson

   salespersonid salespersonName  Age  Salary
0              1             Abe   61  140000
1              2             Bob   34   44000
2              5           Chris   34   40000
3              7             Dan   41   52000
4              8             Ken   57  115000
5             11             Joe   38   38000

In [32]:
# XLSX
customer = pd.read_excel('customer.xlsx')
customer.columns = ['cust_id', 'cust_name', 'City', 'Industry Type']
customer

   cust_id cust_name      City Industry Type
0        4  Samsonic  pleasant             J
1        6  Panasung   oaktown             J
2        7    Samony   jackson             B
3        9    Orange   Jackson             B

## Creating a datatime column

### Changing to datatime format

In [33]:
orders['order_date'] = pd.to_datetime(orders['order_date'])

## Merging datasets using pd.merge()

In [34]:
# first 2 datasets using LEFT JOIN
data = pd.merge(orders, customer, left_on = 'cust_id', right_on = 'cust_id', how = 'left')
data = pd.merge(data, salesperson, left_on = 'salesperson_id', right_on = 'salespersonid', how = 'left')
data.drop('salespersonid', inplace = True, axis = 1)
data

,Number,order_date,cust_id,salesperson_id,Amount,cust_name,City,Industry Type,salespersonName,Age,Salary
0,10,1996-08-02,4,2,2400,Samsonic,pleasant,J,Bob,34,44000
1,20,1999-01-30,4,8,1800,Samsonic,pleasant,J,Ken,57,115000
2,30,1995-07-14,9,1,460,Orange,Jackson,B,Abe,61,140000
3,40,1998-01-29,7,2,540,Samony,jackson,B,Bob,34,44000
4,50,1998-02-03,6,7,600,Panasung,oaktown,J,Dan,41,52000
5,60,1998-03-02,6,7,720,Panasung,oaktown,J,Dan,41,52000
6,70,1998-05-06,9,7,150,Orange,Jackson,B,Dan,41,52000

## Subsetting / Sorting / Groupby

In [54]:
data[data['order_date'].apply(lambda x: x.month) == 1]

,Number,order_date,cust_id,salesperson_id,Amount,cust_name,City,Industry Type,salespersonName,Age,Salary
1,20,1999-01-30,4,8,1800,Samsonic,pleasant,J,Ken,57,115000
3,40,1998-01-29,7,2,540,Samony,jackson,B,Bob,34,44000

In [58]:
data.sort_values('order_date', ascending = False)

,Number,order_date,cust_id,salesperson_id,Amount,cust_name,City,Industry Type,salespersonName,Age,Salary
1,20,1999-01-30,4,8,1800,Samsonic,pleasant,J,Ken,57,115000
6,70,1998-05-06,9,7,150,Orange,Jackson,B,Dan,41,52000
5,60,1998-03-02,6,7,720,Panasung,oaktown,J,Dan,41,52000
4,50,1998-02-03,6,7,600,Panasung,oaktown,J,Dan,41,52000
3,40,1998-01-29,7,2,540,Samony,jackson,B,Bob,34,44000
0,10,1996-08-02,4,2,2400,Samsonic,pleasant,J,Bob,34,44000
2,30,1995-07-14,9,1,460,Orange,Jackson,B,Abe,61,140000

In [71]:
data[data.groupby('salespersonName')['order_date'].transform(max) == data['order_date']]

,Number,order_date,cust_id,salesperson_id,Amount,cust_name,City,Industry Type,salespersonName,Age,Salary
1,20,1999-01-30,4,8,1800,Samsonic,pleasant,J,Ken,57,115000
2,30,1995-07-14,9,1,460,Orange,Jackson,B,Abe,61,140000
3,40,1998-01-29,7,2,540,Samony,jackson,B,Bob,34,44000
6,70,1998-05-06,9,7,150,Orange,Jackson,B,Dan,41,52000

In [76]:
data[data['order_date'].isin(pd.date_range('1998-03-01', '1998-03-17'))]

,Number,order_date,cust_id,salesperson_id,Amount,cust_name,City,Industry Type,salespersonName,Age,Salary
5,60,1998-03-02,6,7,720,Panasung,oaktown,J,Dan,41,52000

In [96]:
(data['order_date'].apply(lambda x: x.month) == 1) &

0    False
1     True
2    False
3    False
4    False
5    False
6    False
Name: order_date, dtype: bool